bank-app/app/views/customers/edit.html.erb

      <%= c.label :bank_id, "Which bank?" %>
      <%= c.collection_select(:bank_id, Bank.all, :id, :name, class: "form-control") %>
---
SELECT "banks".* FROM "banks"