bank-app/app/controllers/accounts_controller.rb

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
SELECT "accounts".* FROM "accounts" WHERE "accounts"."customer_id" = $1  [["customer_id", 35]]
---
  def index
    @get_customer = Customer.find_by(id: params["customer_id"])
    @accounts = @get_customer.accounts.all

SELECT  "accounts".* FROM "accounts" WHERE "accounts"."id" = $1 LIMIT $2  [["id", 34], ["LIMIT", 1]]
---
  def show
    @account = Account.find_by(id: params["id"])

INSERT INTO "accounts" ("balance", "description", "customer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["balance", 0.4999e4], ["description", "test account"], ["customer_id", 45], ["created_at", 2017-05-01 10:39:47 UTC], ["updated_at", 2017-05-01 10:39:47 UTC]]
---
  def create
    account = Account.create(account_params())