bank-app/app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params())
    @customer.bank_id = Bank.first.id
---
SELECT  "banks".* FROM "banks" ORDER BY "banks"."id" ASC LIMIT $1  [["LIMIT", 1]]