bank-app/app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"
---
  def index
    @customers = Customer.all()

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
---
  def show
    account = Account.new
    @customer = Customer.find_by(id: params["id"])

INSERT INTO "customers" ("first_name", "last_name", "tfn", "created_at", "updated_at", "bank_id", "password_digest", "email", "phone_number") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    customer = Customer.create(customer_params())

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 42], ["LIMIT", 1]]
---
  def edit
    @customer = Customer.find_by(id: params["id"])

SELECT  "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT $2  [["id", 44], ["LIMIT", 1]]
UPDATE "customers" SET "first_name" = $1, "updated_at" = $2 WHERE "customers"."id" = $3  [["first_name", "Phil UPDATED"], ["updated_at", 2017-05-01 10:32:24 UTC], ["id", 44]]
---
  def update
    customer = Customer.find_by(id: params["id"])
    customer.update(customer_params())