bank-app/app/controllers/session_controller.rb

  def create
    email = params["email"]
    password = params["password"]
    customer = Customer.find_by(email: email)
---
SELECT  "customers".* FROM "customers" WHERE "customers"."email" = $1 LIMIT $2  [["email", ""], ["LIMIT", 1]]